{
  "backend/main.mo": "Actor providing user profiles, proposal responses, invite-code handling, and mining-related endpoints with access control.",
  "backend/migration.mo": "Migration module converting old actor state to new schema by adding empty mining-related maps.",
  "feature_evidence.json": "JSON report listing feature requirements, associated files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS base/theme definitions with mining‑themed OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point setting page metadata and loading the React application.",
  "frontend/src/App.tsx": "Root React component applying theme provider and rendering the MiningAppShell with notifications.",
  "frontend/src/components/AlternateView.tsx": "Empty placeholder component file.",
  "frontend/src/components/CustomizeDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/MiningAppShell.tsx": "Main authenticated layout managing navigation, login flow, profile setup, and routing between dashboard, settings, and payouts.",
  "frontend/src/components/MiningDashboard.tsx": "Displays mining status, runtime, earnings, and recent events with controls to start or stop mining.",
  "frontend/src/components/MiningHeader.tsx": "Renders the top navigation bar for switching between dashboard, settings, and payouts.",
  "frontend/src/components/MiningSettings.tsx": "Provides a form to view and update mining configuration values like hashrate, power usage, and payout address.",
  "frontend/src/components/Payouts.tsx": "Allows users to request payouts and view payout history based on available mining earnings.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name when first setting up a profile.",
  "frontend/src/components/ProposalFlow.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProposalHeader.tsx": "Empty placeholder component file.",
  "frontend/src/components/ResponseNoteForm.tsx": "Empty placeholder component file.",
  "frontend/src/components/ShareLinkButton.tsx": "Empty placeholder component file.",
  "frontend/src/components/SuccessView.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, identity loading, and auth client setup.",
  "frontend/src/hooks/useMining.ts": "React-query hooks for fetching and mutating mining config, state, events, and starting/stopping mining via the actor.",
  "frontend/src/hooks/usePayouts.ts": "Hooks to fetch payout history and request new payouts, with cache invalidation.",
  "frontend/src/hooks/useProposalConfig.ts": "Empty file.",
  "frontend/src/hooks/useProposalResponse.ts": "Empty file.",
  "frontend/src/hooks/useQueries.ts": "Hooks for loading, saving, and checking admin status of the caller's user profile.",
  "frontend/src/index.css": "Tailwind base/theme setup defining light/dark OKLCH color variables and utility animations.",
  "frontend/src/main.tsx": "App entrypoint initializing React Query and Internet Identity, then rendering App.",
  "frontend/src/types/proposal.ts": "Empty file.",
  "frontend/src/utils/shareLink.ts": "Empty file.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Project metadata describing state, requirements, feature list, and image needs."
}