{
  "backend/main.mo": "Motoko canister with access control implementing user profiles, proposal responses, invite-code RSVPs, and mining-related configuration/state APIs.",
  "feature_evidence.json": "Feature evidence report mapping UX requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of summarized descriptions for all major frontend TypeScript and React components.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining light/dark color tokens for the mining UI.",
  "frontend/index.html": "HTML entry point loading the React mining dashboard application.",
  "frontend/src/App.tsx": "App root providing theme support and rendering the mining app shell with toast notifications.",
  "frontend/src/components/AlternateView.tsx": "Empty placeholder file for declined proposal alternate view.",
  "frontend/src/components/CustomizeDialog.tsx": "Empty placeholder file for proposal customization dialog.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with handling for auth state and query cache reset.",
  "frontend/src/components/MiningAppShell.tsx": "Main authenticated app container managing navigation, auth gating, and profile setup flow.",
  "frontend/src/components/MiningDashboard.tsx": "Dashboard showing mining config/state, start/stop controls, live runtime/earnings, and recent events with error handling.",
  "frontend/src/components/MiningHeader.tsx": "Renders the mining app header with navigation between dashboard, settings, and payouts, supporting both desktop and mobile layouts.",
  "frontend/src/components/MiningSettings.tsx": "Provides a form to view and update mining configuration, validating inputs and saving changes via backend hooks.",
  "frontend/src/components/Payouts.tsx": "Displays payout history and allows submitting payout requests with validation against available mining balance.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects and saves a user's name to create an initial profile.",
  "frontend/src/components/ProposalFlow.tsx": "Empty placeholder component.",
  "frontend/src/components/ProposalHeader.tsx": "Empty placeholder component.",
  "frontend/src/components/ResponseNoteForm.tsx": "Empty placeholder component.",
  "frontend/src/components/ShareLinkButton.tsx": "Empty placeholder component.",
  "frontend/src/components/SuccessView.tsx": "Empty placeholder component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, providing identity state, login handling, and context for the app.",
  "frontend/src/hooks/useMining.ts": "Contains hooks to fetch and mutate mining config, state, events, and mining start/stop actions using the backend actor.",
  "frontend/src/hooks/usePayouts.ts": "Hooks for retrieving payout history and requesting new payouts, with cache invalidation.",
  "frontend/src/hooks/useProposalConfig.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useProposalResponse.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and update the caller’s user profile and check admin status using an actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables for light/dark modes, and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/types/proposal.ts": "Empty placeholder file for proposal-related TypeScript types.",
  "frontend/src/utils/getErrorMessage.ts": "Extracts a user-friendly error message from various error formats, prioritizing backend trap messages.",
  "frontend/src/utils/shareLink.ts": "Empty placeholder for share‑link utility logic.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Project metadata describing current scope, architecture notes, known issues, and existing feature definitions."
}