{
  "backend/main.mo": "Main canister logic providing user profiles, earning items, claims, transactions, VIP status, balances, and authorization checks.",
  "backend/migration.mo": "Defines legacy actor data model and a stubbed migration function for future state migration.",
  "feature_evidence.json": "Feature evidence report mapping high-level feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend components, hooks, and utilities across the project.",
  "frontend/index.css": "Global Tailwind-based styling with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting metadata and loading the main React application.",
  "frontend/src/App.tsx": "Top-level React component rendering the app shell with theme provider and toaster.",
  "frontend/src/components/AlternateView.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/CopyField.tsx": "Reusable component for displaying and copying values with optional masking for sensitive fields.",
  "frontend/src/components/CustomizeDialog.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/exchange/DepositForm.tsx": "Form for creating deposit requests, validating inputs, converting amounts to smallest units, and submitting via createDeposit.",
  "frontend/src/components/exchange/ExchangeHeader.tsx": "Header with navigation tabs that conditionally shows admin pages and includes login controls.",
  "frontend/src/components/exchange/MarketsTable.tsx": "Displays market prices with markup, showing reference and exchange prices plus 24h change with loading and error states.",
  "frontend/src/components/exchange/pages/AdminPanelPage.tsx": "Admin interface for managing deposit addresses and marking deposits or withdrawals as completed.",
  "frontend/src/components/exchange/pages/MarketsPage.tsx": "Renders the markets page showing real‑time cryptocurrency prices using MarketsTable.",
  "frontend/src/components/exchange/pages/SettingsPage.tsx": "Displays exchange settings and renders the pricing settings form.",
  "frontend/src/components/exchange/pages/TradePage.tsx": "Requires login to trade and shows trade ticket and trade history once authenticated.",
  "frontend/src/components/exchange/pages/TransfersPage.tsx": "Provides deposit addresses, deposit/withdrawal forms, and transfer history, requiring login to access.",
  "frontend/src/components/exchange/pages/WalletPage.tsx": "Wallet view requiring login and showing balances and recent activity.",
  "frontend/src/components/exchange/PricingSettingsForm.tsx": "Admin form to view and adjust pricing markup via slider or numeric input and save it.",
  "frontend/src/components/exchange/SimulationDisclosure.tsx": "Static alert explaining that all deposits and withdrawals are manually processed by admin.",
  "frontend/src/components/exchange/TradeHistory.tsx": "Shows user trade history by mapping and sorting trades, with formatted amounts and timestamps.",
  "frontend/src/components/exchange/TradeTicket.tsx": "Form for placing buy or sell market orders, computing amounts, validating inputs, and submitting trades.",
  "frontend/src/components/exchange/TransfersHistory.tsx": "Displays combined deposit and withdrawal history with statuses, references, and timestamps.",
  "frontend/src/components/exchange/WalletActivity.tsx": "Displays recent deposits, withdrawals, and trades by combining and sorting activity data, with loading and empty states.",
  "frontend/src/components/exchange/WalletBalances.tsx": "Shows available balances for all supported assets with loading and error handling.",
  "frontend/src/components/exchange/WithdrawalForm.tsx": "Provides a form to create withdrawal requests, validating balances and submitting via mutation.",
  "frontend/src/components/ExchangeAppShell.tsx": "Main layout controlling navigation, authentication checks, admin gating, and rendering pages with loading states.",
  "frontend/src/components/KeyToolsAppShell.tsx": "App shell for Bitcoin WIF tools with header, security notice, generator, verifier, and educational sections.",
  "frontend/src/components/KeyToolsHeader.tsx": "Sticky header displaying app title and a link to external documentation.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow with loading states and error recovery.",
  "frontend/src/components/MiningAppShell.tsx": "Empty placeholder component.",
  "frontend/src/components/MiningDashboard.tsx": "Empty placeholder component.",
  "frontend/src/components/MiningHeader.tsx": "Empty placeholder component.",
  "frontend/src/components/MiningSettings.tsx": "Empty placeholder component.",
  "frontend/src/components/Payouts.tsx": "Empty placeholder component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter a name and save their profile with validation and loading states.",
  "frontend/src/components/ProposalFlow.tsx": "Empty placeholder component.",
  "frontend/src/components/ProposalHeader.tsx": "Empty placeholder component.",
  "frontend/src/components/ResponseNoteForm.tsx": "Empty placeholder component.",
  "frontend/src/components/SecurityNotice.tsx": "Security warnings describing key-generation safety and user responsibility.",
  "frontend/src/components/ShareLinkButton.tsx": "Empty placeholder component.",
  "frontend/src/components/SuccessView.tsx": "Empty placeholder component.",
  "frontend/src/components/taskora/pages/AdminPanelPage.tsx": "Admin interface for managing USDT addresses and approving or rejecting deposits, withdrawals, claims, and VIP upgrades.",
  "frontend/src/components/taskora/pages/DashboardPage.tsx": "Displays account summary, VIP status, earnings stats, and recent user activity.",
  "frontend/src/components/taskora/pages/EarnPage.tsx": "Shows earning tasks and allows users to submit reward claims with proof and messages.",
  "frontend/src/components/taskora/pages/TransfersPage.tsx": "Handles USDT deposits and withdrawals and shows transfer history with status indicators.",
  "frontend/src/components/taskora/pages/VipPage.tsx": "Displays current VIP tier and allows users to request upgrades with tier benefit details.",
  "frontend/src/components/WifGenerator.tsx": "Generates random Bitcoin WIF keys and displays the WIF, public key, and address with copy fields.",
  "frontend/src/components/WifVerifier.tsx": "Verifies a user‑entered WIF key and derives its public key and address, showing validity and details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, auto-refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useExchangeQueries.ts": "React Query hooks for fetching and mutating exchange state, deposits, withdrawals, and trades using an actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity React context and login/logout handling using Dfinity AuthClient.",
  "frontend/src/hooks/useMarketPrices.ts": "Fetches and caches crypto market prices from CoinGecko with periodic refresh.",
  "frontend/src/hooks/useMining.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/usePayouts.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/usePricingMarkup.ts": "Manages local pricing markup with storage persistence and a helper to apply markup to prices.",
  "frontend/src/hooks/useProposalConfig.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useProposalResponse.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profile fetching, saving, and admin checks via the actor API.",
  "frontend/src/hooks/useRewardQueries.ts": "Queries and mutations for reward-related data like account summaries, activity, earning items, and claims.",
  "frontend/src/index.css": "Tailwind CSS setup with light/dark theme variables and custom animations.",
  "frontend/src/main.tsx": "App entrypoint initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/types/proposal.ts": "Empty placeholder types file.",
  "frontend/src/utils/bitcoinWif.ts": "Implements Base58, Base58Check, hashing, and placeholder key utilities for Bitcoin WIF handling.",
  "frontend/src/utils/getErrorMessage.ts": "Maps various error messages to user-friendly strings and falls back to generic errors for unknown inputs.",
  "frontend/src/utils/shareLink.ts": "Empty utility file with no implemented logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugin extensions.",
  "project_state.json": "Stores project metadata, scope notes, issues, and feature history for the Taskora Global build."
}