{
  "backend/main.mo": "Main canister implementing ownership, user profiles, access control, earning items, claims, transactions, and VIP status management.",
  "backend/migration.mo": "Migration module converting old deposit records to new format by changing empty txId strings into nullable values.",
  "feature_evidence.json": "Feature evidence report mapping high‑level feature requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of summarized frontend file purposes used for build planning and cross‑reference.",
  "frontend/index.css": "Global Tailwind CSS variables and theme definitions for light/dark modes using OKLCH color tokens.",
  "frontend/index.html": "HTML entry point setting metadata, title, and root mount point for the frontend app.",
  "frontend/src/App.tsx": "Top‑level React component providing theme provider, app shell, and global toaster.",
  "frontend/src/components/AlternateView.tsx": "Empty placeholder component file.",
  "frontend/src/components/CopyField.tsx": "Reusable UI field for displaying, revealing, and copying text values with optional sensitivity masking.",
  "frontend/src/components/CustomizeDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/exchange/DepositForm.tsx": "Form to request a deposit specifying asset and amount, submitting via exchange mutation.",
  "frontend/src/components/exchange/ExchangeHeader.tsx": "Renders the exchange header with navigation tabs, showing the Admin tab only when ownership or authentication rules allow it.",
  "frontend/src/components/exchange/MarketsTable.tsx": "Displays market prices with markup and 24h change, handling loading and error states.",
  "frontend/src/components/exchange/pages/AdminPanelPage.tsx": "Admin interface for managing deposit addresses and marking pending deposits and withdrawals as completed.",
  "frontend/src/components/exchange/pages/MarketsPage.tsx": "Renders a markets page showing cryptocurrency prices via the MarketsTable component.",
  "frontend/src/components/exchange/pages/SettingsPage.tsx": "Displays the exchange settings page containing the pricing settings form.",
  "frontend/src/components/exchange/pages/TradePage.tsx": "Gatekeeps trading features behind login and shows trade ticket and history once authenticated.",
  "frontend/src/components/exchange/pages/TransfersPage.tsx": "Provides deposit addresses, deposit/withdrawal forms, and transfer history, requiring login to access.",
  "frontend/src/components/exchange/pages/WalletPage.tsx": "Displays wallet balances and activity for logged-in users, otherwise prompts for login.",
  "frontend/src/components/exchange/PricingSettingsForm.tsx": "Provides a form for adjusting and saving the exchange price markup percentage.",
  "frontend/src/components/exchange/SimulationDisclosure.tsx": "Shows a warning alert explaining that deposits and withdrawals are manually processed by the admin.",
  "frontend/src/components/exchange/TradeHistory.tsx": "Fetches and displays recent trade history, formatting amounts and timestamps.",
  "frontend/src/components/exchange/TradeTicket.tsx": "Allows users to place market buy or sell orders based on selected trading pairs and validated inputs.",
  "frontend/src/components/exchange/TransfersHistory.tsx": "Combines deposit and withdrawal records into a unified transfer history table with status indicators.",
  "frontend/src/components/exchange/WalletActivity.tsx": "Displays recent deposits, withdrawals, and trades by combining exchange state data and rendering a sorted activity table.",
  "frontend/src/components/exchange/WalletBalances.tsx": "Shows a table of user asset balances fetched from exchange state, with loading and error handling.",
  "frontend/src/components/exchange/WithdrawalForm.tsx": "Provides a form to submit withdrawal requests with balance checks, field validation, and mutation handling.",
  "frontend/src/components/ExchangeAppShell.tsx": "Main authenticated application shell handling navigation, identity state, profile setup, and admin access gating.",
  "frontend/src/components/KeyToolsAppShell.tsx": "Main app shell rendering header, hero, security notice, WIF generator, and verifier sections.",
  "frontend/src/components/KeyToolsHeader.tsx": "Top navigation header with branding and link to external documentation.",
  "frontend/src/components/LoginButton.tsx": "Authentication button managing Internet Identity login and logout states.",
  "frontend/src/components/MiningAppShell.tsx": "Empty placeholder component.",
  "frontend/src/components/MiningDashboard.tsx": "Empty placeholder component.",
  "frontend/src/components/MiningHeader.tsx": "Empty placeholder component.",
  "frontend/src/components/MiningSettings.tsx": "Empty placeholder component.",
  "frontend/src/components/Payouts.tsx": "Empty placeholder component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a user profile name via mutation.",
  "frontend/src/components/ProposalFlow.tsx": "Empty placeholder component.",
  "frontend/src/components/ProposalHeader.tsx": "Empty placeholder component.",
  "frontend/src/components/ResponseNoteForm.tsx": "Empty placeholder component.",
  "frontend/src/components/security/AccessDeniedPanel.tsx": "Displays an access-denied message explaining that only the owner authenticated with Internet Identity can access admin features.",
  "frontend/src/components/security/ClaimOwnershipCard.tsx": "Provides a workflow for claiming admin ownership, requiring confirmation text and triggering a permanent ownership claim mutation.",
  "frontend/src/components/security/LoginRequiredPanel.tsx": "Shows a login-required notice instructing users to sign in with Internet Identity to access the admin panel.",
  "frontend/src/components/SecurityNotice.tsx": "Displays warnings explaining privacy and security details of key generation.",
  "frontend/src/components/ShareLinkButton.tsx": "Empty placeholder component.",
  "frontend/src/components/SuccessView.tsx": "Empty placeholder component.",
  "frontend/src/components/taskora/pages/AdminPanelPage.tsx": "Admin interface for managing USDT addresses, deposits, withdrawals, earning claims, and VIP upgrades with various mutation actions.",
  "frontend/src/components/taskora/pages/DashboardPage.tsx": "Displays account summary, VIP status, earnings, and recent activity with loading and error handling.",
  "frontend/src/components/taskora/pages/EarnPage.tsx": "Allows users to watch ads or complete tasks for rewards, tracks daily limits, and submits claims for admin approval.",
  "frontend/src/components/taskora/pages/TransfersPage.tsx": "Enables users to request deposits and withdrawals, upload proof, and view transfer history with validation and status indicators.",
  "frontend/src/components/taskora/pages/VipPage.tsx": "Renders the VIP membership page, showing current tier, tier options, and handling upgrade requests through dialogs and API hooks.",
  "frontend/src/components/WifGenerator.tsx": "Generates a new WIF key and displays private key, public key, and address with copy fields.",
  "frontend/src/components/WifVerifier.tsx": "Verifies a supplied WIF key and derives its public key and address.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, invalidating dependent React Query caches when identity changes.",
  "frontend/src/hooks/useExchangeQueries.ts": "Provides React Query hooks for exchange-related backend operations, including deposits, withdrawals, trades, and fetching exchange state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading stored identities and providing login, logout, and status helpers.",
  "frontend/src/hooks/useLocalDepositProof.ts": "Stores and retrieves a user's local deposit proof with txId and screenshot in localStorage.",
  "frontend/src/hooks/useLocalEarnCatalog.ts": "Generates local earning items and rewards based on VIP tier and calculates daily earning totals.",
  "frontend/src/hooks/useLocalEarnClaims.ts": "Tracks locally submitted earning claims in localStorage and auto-cleans entries older than seven days.",
  "frontend/src/hooks/useLocalEarnQuota.ts": "Manages daily ad and task quota usage in localStorage and provides remaining limits per VIP tier.",
  "frontend/src/hooks/useMarketPrices.ts": "Fetches cryptocurrency market prices from CoinGecko and auto-refetches every 30 seconds.",
  "frontend/src/hooks/useMining.ts": "Empty placeholder file for future mining-related hooks.",
  "frontend/src/hooks/usePayouts.ts": "Empty placeholder file for payout-related hooks.",
  "frontend/src/hooks/usePricingMarkup.ts": "Provides a hook to manage a persisted pricing markup value with clamping and a helper to apply it to prices.",
  "frontend/src/hooks/useProposalConfig.ts": "Empty file placeholder for proposal config logic.",
  "frontend/src/hooks/useProposalResponse.ts": "Empty file placeholder for proposal response hooks.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for loading, saving, and checking admin status of the caller’s user profile via the actor.",
  "frontend/src/hooks/useRewardQueries.ts": "React-query hooks for ownership checks, claiming ownership, account summary retrieval, and recent activity aggregation.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark themes, base styles, and utility animations.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/types/proposal.ts": "Empty type definition file for proposals.",
  "frontend/src/utils/bitcoinWif.ts": "Implements Base58/WIF encoding, decoding, hashing placeholders, and simplified key utilities for Bitcoin keys.",
  "frontend/src/utils/getErrorMessage.ts": "Maps various error messages to user-friendly strings with special handling for authorization and balance errors.",
  "frontend/src/utils/shareLink.ts": "Empty file for share link utilities.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling theme extensions, typography, container queries, and custom animations.",
  "project_state.json": "Contains project version, architectural notes, known issues, and existing features describing the shift to a reward‑based earning platform with admin‑managed USDT flows and required fixes. Lists legacy Valentine-site features, current problems, and design constraints for future development."
}