{
  "kind": "build_request",
  "title": "Simpler VIP-based Earn items + deposit proof fields (tx id + local screenshot)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-66",
      "text": "Ensure the Earn page always shows a simple, working set of earning opportunities (Ads + Tasks) even when the backend has no earning items configured yet, so users never see an empty Earn section by default.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Earn Section mai Ads Show ni ho rhii..",
          "I want you to add random ads and tasks in Earn section for each VIP Package",
          "chal bna de simpler version but acha hona chahye"
        ]
      },
      "acceptanceCriteria": [
        "When a signed-in user opens the Earn page, they see at least a few earning opportunities without requiring manual backend setup.",
        "If earning opportunities cannot be loaded, the UI shows a clear English error state (no stack traces)."
      ]
    },
    {
      "id": "REQ-67",
      "text": "Add a simplified VIP-tier-based earning catalog for the Earn page that provides Ads and Tasks per VIP tier using fixed daily quotas and fixed per-item rewards (as placeholders/randomized titles), and clearly displays the user’s remaining daily quota for Ads/Tasks.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Add Ads and Tasks in Earn Section for Each VIP",
          "Like For Bronze Daily 10 Ads and 0.5$ for each ad watched...",
          "Daily 30 Ads ( earning $70 )"
        ]
      },
      "acceptanceCriteria": [
        "The Earn page reads the caller VIP tier (Basic/Bronze/Silver/Gold/Diamond) and shows the corresponding VIP-tier earning items.",
        "The UI shows remaining counts for “Ads remaining today” and “Tasks remaining today” based on the user’s VIP tier.",
        "Daily limits reset based on the user’s local calendar day (a simple reset is acceptable for this ‘simpler version’).",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-68",
      "text": "Implement a simplified ‘Watch Ad’ flow in the Earn page: clicking an Ad item starts a 30-second countdown; once finished, the user can submit a claim for that Ad reward, and the local daily quota for Ads decrements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "means k 30 seconds ki Koi bhi Ad ...",
          "Daily Ads 10 rakh de ..."
        ]
      },
      "acceptanceCriteria": [
        "An Ad card provides a clear ‘Watch’ action.",
        "Watching an Ad shows a 30-second timer and prevents instant claim submission until the timer completes.",
        "After completion, the user can submit a claim and sees a success toast in English: claim submitted and awaiting admin approval.",
        "The user cannot exceed the daily Ad quota; once quota is reached, the UI disables further Ad watches for the day with an English explanation."
      ]
    },
    {
      "id": "REQ-69",
      "text": "Implement a simplified ‘Complete Task’ flow in the Earn page: tasks can be claimed via a minimal form (e.g., short description/proof text), and the local daily quota for Tasks decrements on submission.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "add random ads and tasks in Earn section for each VIP Package"
        ]
      },
      "acceptanceCriteria": [
        "Task cards provide a ‘Submit Task’ / ‘Claim’ action that opens a minimal claim dialog.",
        "Submitting a task claim decrements the daily Task quota and adds an entry to ‘Your Claims’.",
        "The user cannot exceed the daily Task quota; once quota is reached, the UI disables further task claims for the day with an English explanation."
      ]
    },
    {
      "id": "REQ-70",
      "text": "Update the Transfers (Deposit) UI to include (1) an optional user-entered transaction ID field and (2) a screenshot upload control whose image is stored only locally in the browser (not sent to the backend), with a clear English note that the screenshot stays on this device.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "On Deposit page where user can: Enter transaction ID also Upload screenshot (stored locally) Status remains “Pending until admin check and approve"
        ]
      },
      "acceptanceCriteria": [
        "Deposit tab includes a ‘Transaction ID (optional)’ input.",
        "Deposit tab includes a ‘Upload Screenshot (stored locally)’ input that accepts an image file and shows a small preview.",
        "The screenshot is persisted locally (survives refresh on the same browser/device) and is not uploaded to the backend.",
        "The UI includes a clear English note that admin approval is required and the screenshot is local-only."
      ]
    },
    {
      "id": "REQ-71",
      "text": "Extend the backend deposit-request flow so a user-submitted deposit request can store an optional user-provided transaction ID/note alongside the pending deposit record, and expose it to the owner/admin when reviewing pending deposits.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Enter transaction ID also",
          "Pending until admin check and approve"
        ]
      },
      "acceptanceCriteria": [
        "The deposit request API accepts an optional transaction ID (or note) and stores it with the pending deposit record.",
        "The Admin Panel ‘Pending Deposits’ list shows the user-provided transaction ID (if present) when reviewing the deposit.",
        "Existing deposit status behavior remains: user deposits stay Pending until the owner marks them Completed."
      ]
    },
    {
      "id": "REQ-72",
      "text": "Update the frontend reward hooks and Transfers page to call the updated backend deposit-request method signature (including the optional user transaction ID) and keep React Query cache invalidation so transfer history updates immediately after submission.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "On Deposit page where user can: Enter transaction ID also"
        ]
      },
      "acceptanceCriteria": [
        "Submitting a deposit request sends the amount and the optional transaction ID to the backend.",
        "After submission, the Transfer History list updates without a manual refresh (via existing query invalidation).",
        "Errors are shown as user-friendly English messages using the existing getErrorMessage utility."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Only Internet Identity authentication is allowed; do not add usernames/passwords.",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Do not upload/store deposit screenshots in the backend; screenshots must remain local-only in the browser."
  ],
  "nonGoals": [
    "Integrating real Google ads/CPA networks or fetching real ad creatives from third-party services.",
    "Guaranteeing real earnings or auto-crediting balances without admin approval.",
    "Building a complex anti-fraud system for ad verification in this iteration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}