{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "VIP-based Earn catalog + local quotas + deposit txId/screenshot (local-only)",
  "requirements": [
    {
      "id": "REQ-66",
      "summary": "Ensure Earn page never renders empty by providing a local fallback earning catalog (Ads + Tasks) when backend items are missing or fail to load.",
      "acceptanceCriteria": [
        "When a signed-in user opens the Earn page, they see at least a few earning opportunities without requiring manual backend setup.",
        "If earning opportunities cannot be loaded, the UI shows a clear English error state (no stack traces)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/taskora/pages/EarnPage.tsx",
          "operation": "modify",
          "description": "Change Earn page rendering to avoid an empty state: if backend earning items are empty or fail to load, render a local fallback list of Ads/Tasks, and show a concise English warning/alert when backend items fail to load (without stack traces)."
        },
        {
          "path": "frontend/src/hooks/useLocalEarnCatalog.ts",
          "operation": "create",
          "description": "Add a local-only earn catalog helper hook that can generate a basic set of Ads + Tasks for the caller's VIP tier and provide stable item IDs/titles for display when backend items are unavailable."
        }
      ]
    },
    {
      "id": "REQ-67",
      "summary": "Provide a simplified VIP-tier-based earning catalog with fixed daily quotas/rewards and show remaining daily quota for Ads and Tasks, resetting by local calendar day.",
      "acceptanceCriteria": [
        "The Earn page reads the caller VIP tier (Basic/Bronze/Silver/Gold/Diamond) and shows the corresponding VIP-tier earning items.",
        "The UI shows remaining counts for “Ads remaining today” and “Tasks remaining today” based on the user’s VIP tier.",
        "Daily limits reset based on the user’s local calendar day (a simple reset is acceptable for this ‘simpler version’).",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLocalEarnQuota.ts",
          "operation": "create",
          "description": "Implement localStorage-backed daily quota tracking for Ads/Tasks keyed by local calendar day + VIP tier, exposing remaining counts and decrement helpers."
        },
        {
          "path": "frontend/src/components/taskora/pages/EarnPage.tsx",
          "operation": "modify",
          "description": "Read the caller VIP tier using existing VIP status query, display VIP-tier Ads/Tasks items from the local catalog, and show 'Ads remaining today' and 'Tasks remaining today' with a local-day reset behavior."
        },
        {
          "path": "frontend/src/hooks/useRewardQueries.ts",
          "operation": "modify",
          "description": "Add/adjust a lightweight query usage in Earn flows to read caller VIP tier (reuse existing useGetVIPStatus) so the Earn UI can drive the VIP-tier catalog and quotas consistently."
        }
      ]
    },
    {
      "id": "REQ-68",
      "summary": "Implement a simplified Watch Ad flow with a 30-second countdown gate and local quota decrement on claim submission.",
      "acceptanceCriteria": [
        "An Ad card provides a clear ‘Watch’ action.",
        "Watching an Ad shows a 30-second timer and prevents instant claim submission until the timer completes.",
        "After completion, the user can submit a claim and sees a success toast in English: claim submitted and awaiting admin approval.",
        "The user cannot exceed the daily Ad quota; once quota is reached, the UI disables further Ad watches for the day with an English explanation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/taskora/pages/EarnPage.tsx",
          "operation": "modify",
          "description": "Add an Ad card interaction: 'Watch' starts a 30-second countdown UI; disable claiming until timer completes; on completion allow 'Submit claim' which decrements local Ads quota and shows an English success toast indicating pending admin approval; disable further watches when quota is exhausted with an English explanation."
        },
        {
          "path": "frontend/src/hooks/useLocalEarnQuota.ts",
          "operation": "modify",
          "description": "Add an Ads-specific decrement helper and guard utilities so the Earn UI can prevent exceeding the daily Ads quota."
        },
        {
          "path": "frontend/src/hooks/useLocalEarnClaims.ts",
          "operation": "create",
          "description": "Create a local-only 'Your Claims' store (localStorage-backed) for Ad claims submitted from the simplified flow so the Earn page can show a pending claim entry even when backend items are not configured."
        }
      ]
    },
    {
      "id": "REQ-69",
      "summary": "Implement a simplified Complete Task flow with a minimal claim dialog, local quota decrement, and local 'Your Claims' entry.",
      "acceptanceCriteria": [
        "Task cards provide a ‘Submit Task’ / ‘Claim’ action that opens a minimal claim dialog.",
        "Submitting a task claim decrements the daily Task quota and adds an entry to ‘Your Claims’.",
        "The user cannot exceed the daily Task quota; once quota is reached, the UI disables further task claims for the day with an English explanation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/taskora/pages/EarnPage.tsx",
          "operation": "modify",
          "description": "Add Task card 'Submit Task' action opening a minimal dialog (proof/description text); on submit decrement local Tasks quota, add a pending entry to 'Your Claims', and disable submission when daily quota is exhausted with an English explanation."
        },
        {
          "path": "frontend/src/hooks/useLocalEarnQuota.ts",
          "operation": "modify",
          "description": "Add a Tasks-specific decrement helper and guard utilities so the Earn UI can prevent exceeding the daily Tasks quota."
        },
        {
          "path": "frontend/src/hooks/useLocalEarnClaims.ts",
          "operation": "modify",
          "description": "Extend local claims store to include Task claims (with user-entered proof text) and expose a combined list for rendering in Earn 'Your Claims'."
        }
      ]
    },
    {
      "id": "REQ-70",
      "summary": "Add Deposit UI fields for optional transaction ID and local-only screenshot upload with preview and persistence across refresh, with clear English notes.",
      "acceptanceCriteria": [
        "Deposit tab includes a ‘Transaction ID (optional)’ input.",
        "Deposit tab includes a ‘Upload Screenshot (stored locally)’ input that accepts an image file and shows a small preview.",
        "The screenshot is persisted locally (survives refresh on the same browser/device) and is not uploaded to the backend.",
        "The UI includes a clear English note that admin approval is required and the screenshot is local-only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/taskora/pages/TransfersPage.tsx",
          "operation": "modify",
          "description": "In the Deposit tab, add a 'Transaction ID (optional)' input and an image file input for 'Upload Screenshot (stored locally)' with a small preview; add clear English notes stating deposits remain pending until admin approval and that the screenshot stays on this device and is not sent to the backend."
        },
        {
          "path": "frontend/src/hooks/useLocalDepositProof.ts",
          "operation": "create",
          "description": "Implement localStorage-backed persistence for the deposit transaction ID draft and screenshot (store as data URL) so it survives refresh on the same browser/device; expose helpers for setting/clearing and for generating preview-safe URLs."
        }
      ]
    },
    {
      "id": "REQ-72",
      "summary": "Update frontend deposit request call signature to include optional transaction ID and preserve React Query invalidation so transfer history refreshes immediately, with friendly English errors.",
      "acceptanceCriteria": [
        "Submitting a deposit request sends the amount and the optional transaction ID to the backend.",
        "After submission, the Transfer History list updates without a manual refresh (via existing query invalidation).",
        "Errors are shown as user-friendly English messages using the existing getErrorMessage utility."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useRewardQueries.ts",
          "operation": "modify",
          "description": "Update the Taskora deposit mutation to accept an optional txId parameter and pass it to the backend requestDeposit call; keep the existing React Query cache invalidation so transfer history and recent activity refresh immediately."
        },
        {
          "path": "frontend/src/components/taskora/pages/TransfersPage.tsx",
          "operation": "modify",
          "description": "Wire the optional transaction ID field into the deposit submission call; keep existing getErrorMessage-based error handling and ensure success clears the local txId/screenshot draft as appropriate (screenshot remains local-only)."
        },
        {
          "path": "frontend/src/hooks/useExchangeQueries.ts",
          "operation": "modify",
          "description": "Update exchange deposit mutation to match the updated backend requestDeposit method signature by supplying txId as null when not provided, preventing build/type failures and preserving query invalidation."
        },
        {
          "path": "frontend/src/components/exchange/DepositForm.tsx",
          "operation": "modify",
          "description": "Adjust the exchange deposit request call path (if needed after hook signature change) so deposits continue to submit successfully without requiring a txId, and continue showing user-friendly English success/error toasts."
        }
      ]
    }
  ]
}