{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable mining start/stop UX when config exists but mining state is missing",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Make dashboard start/stop controls depend on saved MiningConfig (not MiningState.config) and provide a clear Settings navigation when config is missing.",
      "acceptanceCriteria": [
        "After saving settings in the Mining Settings page, returning to the dashboard shows start/stop controls (not only a configuration-required card).",
        "If no mining configuration exists, the dashboard shows an English message indicating configuration is required and provides a clear path to the Settings section (e.g., a button that navigates to Settings).",
        "Clicking Start Mining changes the status indicator to Active within one refresh cycle (via react-query invalidation/refetch).",
        "If startMining fails (e.g., authorization/config missing), the UI shows an English toast error that is actionable (not silent), and the button leaves the system in a consistent state (no stuck loading)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MiningDashboard.tsx",
          "operation": "modify",
          "description": "Update dashboard gating logic to use saved miningConfig (via useGetMiningConfig) to determine whether configuration is complete, even when miningState is null; render Start/Stop controls whenever miningConfig exists; when config is missing, show an English configuration-required card with a Settings navigation button; use shared error-message extraction for actionable English toast errors."
        },
        {
          "path": "frontend/src/components/MiningAppShell.tsx",
          "operation": "modify",
          "description": "Wire dashboard-to-settings navigation by passing a callback/prop to MiningDashboard (e.g., onNavigateToSettings) that switches the active section to 'settings', ensuring the dashboard's configuration-required CTA can take the user directly to Settings."
        },
        {
          "path": "frontend/src/utils/getErrorMessage.ts",
          "operation": "create",
          "description": "Add a small utility to normalize backend/agent errors into a clear English message for toasts (prefer backend-provided trap text when available, otherwise use a safe English fallback)."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Ensure recent events list updates immediately after start/stop and surface backend errors in English without misleading success feedback.",
      "acceptanceCriteria": [
        "After Start Mining succeeds, the events query shows a new \"Started\" event without requiring a full page refresh.",
        "After Stop Mining succeeds, the events query shows a new \"Stopped\" event with session-duration details (if available) without requiring a full page refresh.",
        "If the backend rejects the action (e.g., missing config, unauthorized), the frontend displays the backend-provided English error message (or a clear English fallback) and does not show a misleading success toast."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMining.ts",
          "operation": "modify",
          "description": "Strengthen react-query refresh behavior for mining actions: after startMining/stopMining succeed, invalidate and actively refetch miningState and miningEvents so the status indicator and events list update within one refresh cycle; ensure failures propagate cleanly to the UI (no swallowed errors)."
        },
        {
          "path": "frontend/src/components/MiningDashboard.tsx",
          "operation": "modify",
          "description": "After start/stop, rely on react-query invalidation/refetch to update the Recent Activity list without a full page refresh; on failure, show an English toast using the shared error-message utility and avoid any success messaging."
        }
      ]
    }
  ]
}